---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.CentroidHorizontal
source: html/24f053bf-6f0b-54aa-da45-4c7c6ba9bd10.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRound.CentroidHorizontal Property

Distance from centroid to the left extremites along horizontal axis.

## Syntax (C#)
```csharp
public double CentroidHorizontal { get; set; }
```